reports/vllm_fp8_tq/20260523_195840/fp8/bench_fp8_4.stdout.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7e7aa84be9e0>, trust_remote_code=False, seed=1234, num_prompts=1, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8800, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen2.5-3B', input_len=7936, output_len=256, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4.0, burstiness=1.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['variant=fp8', 'kv_cache_dtype=fp8', 'context_len=8192', 'input_len=7936', 'output_len=256'], result_dir='reports/vllm_fp8_tq/20260523_195840/fp8', result_filename='fp8_rate_4.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-49b5a649-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 05-23 19:59:40 [utils.py:90] Sampling input_len from [7936, 7936] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1         
Failed requests:                         0         
Request rate configured (RPS):           4.00      
Benchmark duration (s):                  3.49      
Total input tokens:                      7936      
Total generated tokens:                  256       
Request throughput (req/s):              0.29      
Output token throughput (tok/s):         73.26     
Peak output token throughput (tok/s):    81.00     
Peak concurrent requests:                1.00      
Total token throughput (tok/s):          2344.24   
---------------Time to First Token----------------
Mean TTFT (ms):                          98.71     
Median TTFT (ms):                        98.71     
P50 TTFT (ms):                           98.71     
P90 TTFT (ms):                           98.71     
P99 TTFT (ms):                           98.71     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          12.33     
Median TPOT (ms):                        12.33     
P50 TPOT (ms):                           12.33     
P90 TPOT (ms):                           12.33     
P99 TPOT (ms):                           12.33     
---------------Inter-token Latency----------------
Mean ITL (ms):                           12.33     
Median ITL (ms):                         12.34     
P50 ITL (ms):                            12.34     
P90 ITL (ms):                            12.93     
P99 ITL (ms):                            13.95     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          3243.28   
Median E2EL (ms):                        3243.28   
P50 E2EL (ms):                           3243.28   
P90 E2EL (ms):                           3243.28   
P99 E2EL (ms):                           3243.28   
==================================================